domains/mirror/pe/ofTemplates/RANS_INCOMPRESSIBLE/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pOut            0;
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform $pOut;

boundaryField
{

    "(left|bottom|top|front).*"
    {
        type            zeroGradient;
    }

    right
    {
        type            fixedValue;
        value           $internalField;
    }


// WALLS
    back
    {
        type            zeroGradient;
    } 

    carGroup 
    {
        type            zeroGradient;
    }

}


